## 그래프형 데이터 모델
정점(vertex) = 노드 = 엔티티
간선(edge) = 관계 = 호(src)

일반적으로 소셜 그래프, 웹그래프(페이지랭크), 도로나 철도 네트워크 데이터를 그래프로 모델링 할수있다.
그래프는 동종데이터에 국한되지 않는다! 예를 들어 페이스북은 사람, 장소, 이벤트, 체크인, 사용자가 작성한 코멘트를 정점으로 사용하고 어떤사람이 서로 친구인지 어떤 위치에서 체크인이 발생했는지 누가 어떤 포스트에 코멘트를 했는지 누가 이벤트에 참석했는지를 나타낸다.

- 카카오 그래프 디비 (S2 Graph)[https://tech.kakao.com/2016/01/29/opensource-1-s2graph]
- T map 그래프 디비

### 속성 그래프 모델
- 종류: Neo4j, Titan, InfiniteGraph
- 정점의 구성: 고유한 식별자, outgoing edge, incoming edge, 속성 컬렉션(키-값 쌍)
- 간선의 구성: 고유한 식별자, 꼬리 정점(간선이 시작하는 vertex), 머리 정점(간선이 끝나는 vertex), 관계 유형을 설명하는 레이블, 속성 컬렉션(키-값 쌍)

### 트리플 저장소 모델(Triple-Stores)
- Datomic(데이토믹), Allegrograph(알레그로그래프)
- 모든 정보를 `주어(subject), 서술어(predicate), 목적어(object)` 처럼 세구문 형식(three-part statement)으로 저장한다.
- e.g. 나는 바나나를 좋아해 -> (나, 좋아하다, 바나나)
       달미와 도산이가 결혼해 -> (달미, 결혼하다, 도산)
- 목적어는 바나나와 같이 **값**이 될수도 있고 도산이와 같이 **그래프의 다른 정점**이 될수도 있다.
- 트리플은 터틀(Turtle) 형식으로 작성할수있다. (터틀 형식은 Notation3=N3 형식의 부분집합이다.)
```
@prefix : <urn:example:>.
_:lucy  a :Person.
_:lucy  :name "Lucy".
_:lucy  :boarnIn  _:idaho.
_:idaho a :Location.
_:idaho :name "Idaho".
```
  
### 그래프용 질의 언어
- 선언형: Cypher(사이퍼), SPARQL(스파클), Datalog
- 명령형: Gremlin(그렘린)
- 그래프 처리 프레임워크: Pregel(프리글)

#### 사이퍼 (Cyper)
속성 그래프를 위한 선언형 질의언어이다.

데이터 표현(저장)방법은 아래와 같다.
```
CREATE
  (NAmerica:Location {name: 'North America', type: 'continent'}),
  (USA:Location {name: 'United States', type: 'country'}),
  (Idaho:Location {name: 'Idaho', type: 'state'}),
  (Lucy:Person {name: 'Lucy'}),
  (Idaho) -[:WITHIN]-> (USA) -[:WITHIN]-> (NAmerica),
  (Lucy) -[:BOARN_IN]-> (Idaho)
```
데이터 질의 방법은 아래와 같다. 
`:WITHIN*0..`은 '0회 이상 WITHIN 간선을 따라가라' 라는 의미이다. 정규표현식의 * 연산자와 같다.
```
MATCH
  (person) -[:BOARN_IN]-> () -[:WITHIN*0..]-> (us:Location {name: 'United States'}),
  (person) -[:LIVES_IN]-> () -[:WITHIN*0..]-> (us:Location {name: 'Europe'})
RETURN person.name
```

#### 스파클 (SPARQL)
RDF 데이터 모델을 사용한 트리플 저장소 질의 언어이다.
```
PREFIX: <urn:example:>

SELECT ?personName WHERE {
  ?person :name ?personName.
  ?person :bornIn / :within*  / :name "United States".
  ?person :livesIn  / :within*  / :name "Europe".
}
```

#### 그래프 데이터베이스와 네트워크 모델(코다실)의 비교
| 종류             | 코다실DB                                                                                               | 그래프DB                                                                   |
| :--------------- | :----------------------------------------------------------------------------------------------------- | :------------------------------------------------------------------------- |
| 데이터중첩       | 중첩 가능한 레코드 타입을 지정하는 스키마가 있다                                                       | 제한없음                                                                   |
| 레코드 도달 방법 | 접근 경로중 하나를 탐색                                                                                | 고유 ID로 직접 참조하거나 index를 사용해 특정 값을 가진 정점을 빠르게 찾음 |
| 정렬             | 정렬을 유지해야함.(저장소 배치에 영향을 줄 수 있다) 데이터를 넣을 때 새로운 레코드의 위치를 고려해야함 | 정렬하지 않음. 질의할 때만 정렬 가능.                                      |
| 질의             | 명령형. 어려워. 스키마 변경시 질의 수정해야함.                                                         | 명령형으로 작성가능하나 사이퍼나 스파클같은 고수준 선언형 질의 언어 제공   |


#### 데이터로그 (Datalog)

- 잘 알려져있진 않지만, 다른 질의언어에 초석이 되었다!
- 데이토믹은 데이터로그를 질의언어로 사용한다.
- 데이터로그는 캐스캘로그(Cascalog)로 구현되어 있는데, 캐스캘로그는 하둡의 대용량 데이터셋 질의를 할때에도 사용된다.
- 트리플 저장소 모델과 유사하지만 좀더 일반화 되었다. `(주어, 서술어, 목적어)` 가 아닌 `서술어(주어, 목적어)`로 작성한다.